mapkeeper/ycsb/data/thrift2/hsha_2000
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MapKeeperClient -P workloads/workloada -p mapkeeper.host=dqa-config2-006.dht.bf1.yahoo.com -p mapkeeper.port=9090 -s -threads 2000 -load
Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
 0 sec: 0 operations; 
Maximum execution time specified as: 60 secs
 10 sec: 570260 operations; 56781.84 current ops/sec; [INSERT AverageLatency(us)=19290.59] 
 20 sec: 1157259 operations; 58664.7 current ops/sec; [INSERT AverageLatency(us)=28188.85] 
 30 sec: 1773391 operations; 61582.41 current ops/sec; [INSERT AverageLatency(us)=28305.39] 
 40 sec: 2438841 operations; 66518.39 current ops/sec; [INSERT AverageLatency(us)=26999.98] 
 50 sec: 3014334 operations; 57532.04 current ops/sec; [INSERT AverageLatency(us)=31375.34] 
 60 sec: 3590014 operations; 57544.98 current ops/sec; [INSERT AverageLatency(us)=32777.14] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
Still waiting for thread Thread-1701 to complete. Workload status: true
Still waiting for thread Thread-1701 to complete. Workload status: true
 70 sec: 3817755 operations; 22764.99 current ops/sec; [INSERT AverageLatency(us)=33062.15] 
Still waiting for thread Thread-1701 to complete. Workload status: true
Still waiting for thread Thread-1701 to complete. Workload status: true
Still waiting for thread Thread-1701 to complete. Workload status: true
[...]
 80 sec: 3817755 operations; 0 current ops/sec;  
Still waiting for thread Thread-1701 to complete. Workload status: true
Still waiting for thread Thread-1701 to complete. Workload status: true
Still waiting for thread Thread-1701 to complete. Workload status: true
[...]
 90 sec: 3817755 operations; 0 current ops/sec;  
Still waiting for thread Thread-1701 to complete. Workload status: true
Still waiting for thread Thread-1701 to complete. Workload status: true
Still waiting for thread Thread-1701 to complete. Workload status: true
[...]
 97 sec: 3817755 operations; 0 current ops/sec;  
[OVERALL], RunTime(ms), 97020.0
[OVERALL], Throughput(ops/sec), 39350.185528756956
[INSERT], Operations, 3817755
[INSERT], AverageLatency(us), 28133.438956402388
[INSERT], MinLatency(us), 261
[INSERT], MaxLatency(us), 1571779
[INSERT], 95thPercentileLatency(ms), 34
[INSERT], 99thPercentileLatency(ms), 38
[INSERT], Return=0, 3817755
[INSERT], 0, 5794
[INSERT], 1, 13199
[INSERT], 2, 14895
[INSERT], 3, 20529
[INSERT], 4, 21854
[INSERT], 5, 21962
[INSERT], 6, 18487
[INSERT], 7, 13972
[INSERT], 8, 10819
[INSERT], 9, 7241
[INSERT], 10, 6725
[INSERT], 11, 5012
[INSERT], 12, 4450
[INSERT], 13, 3091
[INSERT], 14, 2560
[INSERT], 15, 3286
[INSERT], 16, 3015
[INSERT], 17, 2263
[INSERT], 18, 1795
[INSERT], 19, 1431
[INSERT], 20, 2908
[INSERT], 21, 10777
[INSERT], 22, 34184
[INSERT], 23, 101877
[INSERT], 24, 103675
[INSERT], 25, 321121
[INSERT], 26, 540708
[INSERT], 27, 515119
[INSERT], 28, 361845
[INSERT], 29, 294594
[INSERT], 30, 281059
[INSERT], 31, 320366
[INSERT], 32, 268507
[INSERT], 33, 183266
[INSERT], 34, 128578
[INSERT], 35, 72863
[INSERT], 36, 31588
[INSERT], 37, 23065
[INSERT], 38, 13869
[INSERT], 39, 8616
[INSERT], 40, 4976
[INSERT], 41, 2623
[INSERT], 42, 1426
[INSERT], 43, 1318
[INSERT], 44, 804
[INSERT], 45, 554
[INSERT], 46, 701
[INSERT], 47, 678
[INSERT], 48, 550
[INSERT], 49, 456
[INSERT], 50, 385
[INSERT], 51, 223
[INSERT], 52, 276
[INSERT], 53, 127
[INSERT], 54, 110
[INSERT], 55, 143
[INSERT], 56, 37
[INSERT], 57, 52
[INSERT], 58, 85
[INSERT], 59, 69
[INSERT], 60, 80
[INSERT], 61, 63
[INSERT], 62, 46
[INSERT], 63, 50
[INSERT], 64, 41
[INSERT], 65, 42
[INSERT], 66, 54
[INSERT], 67, 44
[INSERT], 68, 44
[INSERT], 69, 50
[INSERT], 70, 23
[INSERT], 71, 23
[INSERT], 72, 8
[INSERT], 73, 3
[INSERT], 74, 6
[INSERT], 75, 23
[INSERT], 76, 10
[INSERT], 77, 9
[INSERT], 78, 4
[INSERT], 79, 2
[INSERT], 80, 8
[INSERT], 81, 7
[INSERT], 82, 5
[INSERT], 83, 6
[INSERT], 84, 1
[INSERT], 85, 1
[INSERT], 86, 4
[INSERT], 87, 7
[INSERT], 88, 0
[INSERT], 89, 1
[INSERT], 90, 0
[INSERT], 91, 0
[INSERT], 92, 0
[INSERT], 93, 0
[INSERT], 94, 0
[INSERT], 95, 1
[INSERT], 96, 1
[INSERT], 97, 1
[INSERT], 98, 1
[INSERT], 99, 0
[INSERT], 100, 0
[INSERT], 101, 1
[INSERT], 102, 1
[INSERT], 103, 0
[INSERT], 104, 0
[INSERT], 105, 1
[INSERT], 106, 2
[INSERT], 107, 0
[INSERT], 108, 0
[INSERT], 109, 2
[INSERT], 110, 0
[INSERT], 111, 0
[INSERT], 112, 0
[INSERT], 113, 0
[INSERT], 114, 0
[INSERT], 115, 0
[INSERT], 116, 2
[INSERT], 117, 0
[INSERT], 118, 0
[INSERT], 119, 0
[INSERT], 120, 3
[INSERT], 121, 1
[INSERT], 122, 0
[INSERT], 123, 0
[INSERT], 124, 2
[INSERT], 125, 1
[INSERT], 126, 0
[INSERT], 127, 0
[INSERT], 128, 2
[INSERT], 129, 0
[INSERT], 130, 2
[INSERT], 131, 2
[INSERT], 132, 1
[INSERT], 133, 1
[INSERT], 134, 0
[INSERT], 135, 0
[INSERT], 136, 0
[INSERT], 137, 0
[INSERT], 138, 0
[INSERT], 139, 1
[INSERT], 140, 1
[INSERT], 141, 0
[INSERT], 142, 0
[INSERT], 143, 0
[INSERT], 144, 1
[INSERT], 145, 1
[INSERT], 146, 0
[INSERT], 147, 1
[INSERT], 148, 0
[INSERT], 149, 0
[INSERT], 150, 0
[INSERT], 151, 1
[INSERT], 152, 0
[INSERT], 153, 0
[INSERT], 154, 0
[INSERT], 155, 1
[INSERT], 156, 1
[INSERT], 157, 1
[INSERT], 158, 1
[INSERT], 159, 0
[INSERT], 160, 0
[INSERT], 161, 0
[INSERT], 162, 1
[INSERT], 163, 0
[INSERT], 164, 0
[INSERT], 165, 0
[INSERT], 166, 0
[INSERT], 167, 0
[INSERT], 168, 1
[INSERT], 169, 1
[INSERT], 170, 0
[INSERT], 171, 0
[INSERT], 172, 0
[INSERT], 173, 1
[INSERT], 174, 1
[INSERT], 175, 0
[INSERT], 176, 2
[INSERT], 177, 1
[INSERT], 178, 0
[INSERT], 179, 0
[INSERT], 180, 0
[INSERT], 181, 0
[INSERT], 182, 0
[INSERT], 183, 1
[INSERT], 184, 1
[INSERT], 185, 0
[INSERT], 186, 1
[INSERT], 187, 1
[INSERT], 188, 0
[INSERT], 189, 0
[INSERT], 190, 0
[INSERT], 191, 0
[INSERT], 192, 0
[INSERT], 193, 2
[INSERT], 194, 0
[INSERT], 195, 0
[INSERT], 196, 0
[INSERT], 197, 0
[INSERT], 198, 0
[INSERT], 199, 1
[INSERT], 200, 0
[INSERT], 201, 2
[INSERT], 202, 0
[INSERT], 203, 1
[INSERT], 204, 0
[INSERT], 205, 2
[INSERT], 206, 1
[INSERT], 207, 0
[INSERT], 208, 0
[INSERT], 209, 0
[INSERT], 210, 0
[INSERT], 211, 1
[INSERT], 212, 0
[INSERT], 213, 0
[INSERT], 214, 1
[INSERT], 215, 0
[INSERT], 216, 0
[INSERT], 217, 0
[INSERT], 218, 0
[INSERT], 219, 1
[INSERT], 220, 1
[INSERT], 221, 0
[INSERT], 222, 1
[INSERT], 223, 0
[INSERT], 224, 0
[INSERT], 225, 0
[INSERT], 226, 0
[INSERT], 227, 1
[INSERT], 228, 2
[INSERT], 229, 0
[INSERT], 230, 0
[INSERT], 231, 0
[INSERT], 232, 0
[INSERT], 233, 1
[INSERT], 234, 1
[INSERT], 235, 0
[INSERT], 236, 0
[INSERT], 237, 0
[INSERT], 238, 2
[INSERT], 239, 0
[INSERT], 240, 0
[INSERT], 241, 0
[INSERT], 242, 0
[INSERT], 243, 1
[INSERT], 244, 0
[INSERT], 245, 0
[INSERT], 246, 1
[INSERT], 247, 0
[INSERT], 248, 0
[INSERT], 249, 0
[INSERT], 250, 0
[INSERT], 251, 0
[INSERT], 252, 1
[INSERT], 253, 0
[INSERT], 254, 1
[INSERT], 255, 1
[INSERT], 256, 0
[INSERT], 257, 1
[INSERT], 258, 0
[INSERT], 259, 0
[INSERT], 260, 1
[INSERT], 261, 1
[INSERT], 262, 0
[INSERT], 263, 0
[INSERT], 264, 0
[INSERT], 265, 1
[INSERT], 266, 0
[INSERT], 267, 1
[INSERT], 268, 0
[INSERT], 269, 2
[INSERT], 270, 0
[INSERT], 271, 0
[INSERT], 272, 0
[INSERT], 273, 0
[INSERT], 274, 1
[INSERT], 275, 0
[INSERT], 276, 1
[INSERT], 277, 1
[INSERT], 278, 1
[INSERT], 279, 0
[INSERT], 280, 0
[INSERT], 281, 0
[INSERT], 282, 0
[INSERT], 283, 0
[INSERT], 284, 1
[INSERT], 285, 1
[INSERT], 286, 0
[INSERT], 287, 3
[INSERT], 288, 0
[INSERT], 289, 1
[INSERT], 290, 0
[INSERT], 291, 0
[INSERT], 292, 0
[INSERT], 293, 0
[INSERT], 294, 2
[INSERT], 295, 1
[INSERT], 296, 1
[INSERT], 297, 0
[INSERT], 298, 0
[INSERT], 299, 0
[INSERT], 300, 0
[INSERT], 301, 1
[INSERT], 302, 1
[INSERT], 303, 1
[INSERT], 304, 2
[INSERT], 305, 0
[INSERT], 306, 2
[INSERT], 307, 0
[INSERT], 308, 1
[INSERT], 309, 0
[INSERT], 310, 1
[INSERT], 311, 0
[INSERT], 312, 1
[INSERT], 313, 0
[INSERT], 314, 1
[INSERT], 315, 1
[INSERT], 316, 0
[INSERT], 317, 0
[INSERT], 318, 0
[INSERT], 319, 1
[INSERT], 320, 0
[INSERT], 321, 1
[INSERT], 322, 0
[INSERT], 323, 0
[INSERT], 324, 1
[INSERT], 325, 0
[INSERT], 326, 0
[INSERT], 327, 1
[INSERT], 328, 1
[INSERT], 329, 0
[INSERT], 330, 0
[INSERT], 331, 1
[INSERT], 332, 1
[INSERT], 333, 0
[INSERT], 334, 1
[INSERT], 335, 1
[INSERT], 336, 0
[INSERT], 337, 1
[INSERT], 338, 0
[INSERT], 339, 0
[INSERT], 340, 0
[INSERT], 341, 0
[INSERT], 342, 1
[INSERT], 343, 0
[INSERT], 344, 1
[INSERT], 345, 0
[INSERT], 346, 0
[INSERT], 347, 0
[INSERT], 348, 1
[INSERT], 349, 0
[INSERT], 350, 1
[INSERT], 351, 2
[INSERT], 352, 0
[INSERT], 353, 0
[INSERT], 354, 0
[INSERT], 355, 0
[INSERT], 356, 0
[INSERT], 357, 0
[INSERT], 358, 1
[INSERT], 359, 0
[INSERT], 360, 1
[INSERT], 361, 0
[INSERT], 362, 1
[INSERT], 363, 0
[INSERT], 364, 0
[INSERT], 365, 0
[INSERT], 366, 2
[INSERT], 367, 0
[INSERT], 368, 0
[INSERT], 369, 0
[INSERT], 370, 0
[INSERT], 371, 1
[INSERT], 372, 0
[INSERT], 373, 0
[INSERT], 374, 0
[INSERT], 375, 2
[INSERT], 376, 1
[INSERT], 377, 0
[INSERT], 378, 0
[INSERT], 379, 1
[INSERT], 380, 1
[INSERT], 381, 1
[INSERT], 382, 0
[INSERT], 383, 1
[INSERT], 384, 1
[INSERT], 385, 0
[INSERT], 386, 0
[INSERT], 387, 0
[INSERT], 388, 0
[INSERT], 389, 0
[INSERT], 390, 0
[INSERT], 391, 1
[INSERT], 392, 0
[INSERT], 393, 0
[INSERT], 394, 0
[INSERT], 395, 1
[INSERT], 396, 2
[INSERT], 397, 1
[INSERT], 398, 0
[INSERT], 399, 0
[INSERT], 400, 1
[INSERT], 401, 1
[INSERT], 402, 0
[INSERT], 403, 0
[INSERT], 404, 0
[INSERT], 405, 1
[INSERT], 406, 0
[INSERT], 407, 0
[INSERT], 408, 0
[INSERT], 409, 1
[INSERT], 410, 1
[INSERT], 411, 2
[INSERT], 412, 0
[INSERT], 413, 0
[INSERT], 414, 0
[INSERT], 415, 0
[INSERT], 416, 0
[INSERT], 417, 0
[INSERT], 418, 0
[INSERT], 419, 1
[INSERT], 420, 1
[INSERT], 421, 0
[INSERT], 422, 0
[INSERT], 423, 1
[INSERT], 424, 0
[INSERT], 425, 0
[INSERT], 426, 0
[INSERT], 427, 0
[INSERT], 428, 3
[INSERT], 429, 1
[INSERT], 430, 0
[INSERT], 431, 0
[INSERT], 432, 1
[INSERT], 433, 0
[INSERT], 434, 0
[INSERT], 435, 0
[INSERT], 436, 1
[INSERT], 437, 0
[INSERT], 438, 0
[INSERT], 439, 1
[INSERT], 440, 0
[INSERT], 441, 0
[INSERT], 442, 0
[INSERT], 443, 1
[INSERT], 444, 0
[INSERT], 445, 1
[INSERT], 446, 0
[INSERT], 447, 1
[INSERT], 448, 0
[INSERT], 449, 0
[INSERT], 450, 0
[INSERT], 451, 0
[INSERT], 452, 1
[INSERT], 453, 3
[INSERT], 454, 0
[INSERT], 455, 2
[INSERT], 456, 0
[INSERT], 457, 0
[INSERT], 458, 0
[INSERT], 459, 0
[INSERT], 460, 0
[INSERT], 461, 0
[INSERT], 462, 0
[INSERT], 463, 0
[INSERT], 464, 0
[INSERT], 465, 1
[INSERT], 466, 1
[INSERT], 467, 2
[INSERT], 468, 0
[INSERT], 469, 0
[INSERT], 470, 0
[INSERT], 471, 0
[INSERT], 472, 0
[INSERT], 473, 1
[INSERT], 474, 0
[INSERT], 475, 0
[INSERT], 476, 1
[INSERT], 477, 0
[INSERT], 478, 2
[INSERT], 479, 1
[INSERT], 480, 0
[INSERT], 481, 1
[INSERT], 482, 0
[INSERT], 483, 1
[INSERT], 484, 0
[INSERT], 485, 0
[INSERT], 486, 0
[INSERT], 487, 0
[INSERT], 488, 0
[INSERT], 489, 0
[INSERT], 490, 0
[INSERT], 491, 1
[INSERT], 492, 0
[INSERT], 493, 1
[INSERT], 494, 2
[INSERT], 495, 0
[INSERT], 496, 0
[INSERT], 497, 0
[INSERT], 498, 0
[INSERT], 499, 0
[INSERT], 500, 1
[INSERT], 501, 0
[INSERT], 502, 0
[INSERT], 503, 0
[INSERT], 504, 0
[INSERT], 505, 1
[INSERT], 506, 1
[INSERT], 507, 1
[INSERT], 508, 0
[INSERT], 509, 0
[INSERT], 510, 1
[INSERT], 511, 1
[INSERT], 512, 0
[INSERT], 513, 0
[INSERT], 514, 1
[INSERT], 515, 0
[INSERT], 516, 0
[INSERT], 517, 0
[INSERT], 518, 0
[INSERT], 519, 1
[INSERT], 520, 1
[INSERT], 521, 0
[INSERT], 522, 0
[INSERT], 523, 1
[INSERT], 524, 0
[INSERT], 525, 0
[INSERT], 526, 2
[INSERT], 527, 0
[INSERT], 528, 0
[INSERT], 529, 0
[INSERT], 530, 0
[INSERT], 531, 0
[INSERT], 532, 0
[INSERT], 533, 0
[INSERT], 534, 0
[INSERT], 535, 1
[INSERT], 536, 1
[INSERT], 537, 1
[INSERT], 538, 1
[INSERT], 539, 1
[INSERT], 540, 0
[INSERT], 541, 0
[INSERT], 542, 0
[INSERT], 543, 0
[INSERT], 544, 0
[INSERT], 545, 0
[INSERT], 546, 1
[INSERT], 547, 0
[INSERT], 548, 1
[INSERT], 549, 0
[INSERT], 550, 0
[INSERT], 551, 2
[INSERT], 552, 1
[INSERT], 553, 0
[INSERT], 554, 1
[INSERT], 555, 0
[INSERT], 556, 0
[INSERT], 557, 0
[INSERT], 558, 0
[INSERT], 559, 1
[INSERT], 560, 0
[INSERT], 561, 0
[INSERT], 562, 3
[INSERT], 563, 0
[INSERT], 564, 0
[INSERT], 565, 0
[INSERT], 566, 0
[INSERT], 567, 1
[INSERT], 568, 0
[INSERT], 569, 1
[INSERT], 570, 1
[INSERT], 571, 0
[INSERT], 572, 0
[INSERT], 573, 0
[INSERT], 574, 1
[INSERT], 575, 0
[INSERT], 576, 0
[INSERT], 577, 0
[INSERT], 578, 0
[INSERT], 579, 0
[INSERT], 580, 1
[INSERT], 581, 0
[INSERT], 582, 1
[INSERT], 583, 0
[INSERT], 584, 0
[INSERT], 585, 2
[INSERT], 586, 0
[INSERT], 587, 0
[INSERT], 588, 0
[INSERT], 589, 0
[INSERT], 590, 1
[INSERT], 591, 1
[INSERT], 592, 0
[INSERT], 593, 2
[INSERT], 594, 0
[INSERT], 595, 0
[INSERT], 596, 1
[INSERT], 597, 0
[INSERT], 598, 0
[INSERT], 599, 0
[INSERT], 600, 0
[INSERT], 601, 0
[INSERT], 602, 1
[INSERT], 603, 1
[INSERT], 604, 0
[INSERT], 605, 1
[INSERT], 606, 1
[INSERT], 607, 0
[INSERT], 608, 2
[INSERT], 609, 1
[INSERT], 610, 0
[INSERT], 611, 0
[INSERT], 612, 2
[INSERT], 613, 2
[INSERT], 614, 1
[INSERT], 615, 4
[INSERT], 616, 3
[INSERT], 617, 1
[INSERT], 618, 2
[INSERT], 619, 6
[INSERT], 620, 3
[INSERT], 621, 2
[INSERT], 622, 4
[INSERT], 623, 2
[INSERT], 624, 1
[INSERT], 625, 0
[INSERT], 626, 2
[INSERT], 627, 2
[INSERT], 628, 2
[INSERT], 629, 1
[INSERT], 630, 0
[INSERT], 631, 1
[INSERT], 632, 2
[INSERT], 633, 0
[INSERT], 634, 0
[INSERT], 635, 0
[INSERT], 636, 0
[INSERT], 637, 0
[INSERT], 638, 1
[INSERT], 639, 0
[INSERT], 640, 0
[INSERT], 641, 1
[INSERT], 642, 0
[INSERT], 643, 1
[INSERT], 644, 0
[INSERT], 645, 1
[INSERT], 646, 0
[INSERT], 647, 0
[INSERT], 648, 0
[INSERT], 649, 0
[INSERT], 650, 0
[INSERT], 651, 1
[INSERT], 652, 0
[INSERT], 653, 0
[INSERT], 654, 3
[INSERT], 655, 0
[INSERT], 656, 1
[INSERT], 657, 4
[INSERT], 658, 3
[INSERT], 659, 2
[INSERT], 660, 2
[INSERT], 661, 6
[INSERT], 662, 1
[INSERT], 663, 5
[INSERT], 664, 1
[INSERT], 665, 1
[INSERT], 666, 2
[INSERT], 667, 1
[INSERT], 668, 1
[INSERT], 669, 3
[INSERT], 670, 0
[INSERT], 671, 1
[INSERT], 672, 0
[INSERT], 673, 0
[INSERT], 674, 0
[INSERT], 675, 0
[INSERT], 676, 0
[INSERT], 677, 0
[INSERT], 678, 0
[INSERT], 679, 1
[INSERT], 680, 0
[INSERT], 681, 0
[INSERT], 682, 0
[INSERT], 683, 0
[INSERT], 684, 0
[INSERT], 685, 1
[INSERT], 686, 0
[INSERT], 687, 0
[INSERT], 688, 0
[INSERT], 689, 0
[INSERT], 690, 0
[INSERT], 691, 1
[INSERT], 692, 0
[INSERT], 693, 0
[INSERT], 694, 1
[INSERT], 695, 0
[INSERT], 696, 0
[INSERT], 697, 0
[INSERT], 698, 2
[INSERT], 699, 0
[INSERT], 700, 1
[INSERT], 701, 1
[INSERT], 702, 2
[INSERT], 703, 4
[INSERT], 704, 1
[INSERT], 705, 1
[INSERT], 706, 4
[INSERT], 707, 3
[INSERT], 708, 2
[INSERT], 709, 0
[INSERT], 710, 2
[INSERT], 711, 0
[INSERT], 712, 2
[INSERT], 713, 0
[INSERT], 714, 0
[INSERT], 715, 1
[INSERT], 716, 1
[INSERT], 717, 1
[INSERT], 718, 0
[INSERT], 719, 0
[INSERT], 720, 1
[INSERT], 721, 0
[INSERT], 722, 0
[INSERT], 723, 1
[INSERT], 724, 0
[INSERT], 725, 0
[INSERT], 726, 0
[INSERT], 727, 0
[INSERT], 728, 0
[INSERT], 729, 0
[INSERT], 730, 0
[INSERT], 731, 0
[INSERT], 732, 0
[INSERT], 733, 0
[INSERT], 734, 1
[INSERT], 735, 0
[INSERT], 736, 0
[INSERT], 737, 0
[INSERT], 738, 0
[INSERT], 739, 1
[INSERT], 740, 0
[INSERT], 741, 0
[INSERT], 742, 1
[INSERT], 743, 0
[INSERT], 744, 4
[INSERT], 745, 1
[INSERT], 746, 3
[INSERT], 747, 2
[INSERT], 748, 0
[INSERT], 749, 2
[INSERT], 750, 1
[INSERT], 751, 0
[INSERT], 752, 2
[INSERT], 753, 2
[INSERT], 754, 1
[INSERT], 755, 3
[INSERT], 756, 0
[INSERT], 757, 0
[INSERT], 758, 1
[INSERT], 759, 0
[INSERT], 760, 0
[INSERT], 761, 0
[INSERT], 762, 0
[INSERT], 763, 0
[INSERT], 764, 0
[INSERT], 765, 0
[INSERT], 766, 0
[INSERT], 767, 0
[INSERT], 768, 1
[INSERT], 769, 0
[INSERT], 770, 0
[INSERT], 771, 1
[INSERT], 772, 0
[INSERT], 773, 0
[INSERT], 774, 0
[INSERT], 775, 0
[INSERT], 776, 0
[INSERT], 777, 1
[INSERT], 778, 0
[INSERT], 779, 0
[INSERT], 780, 0
[INSERT], 781, 0
[INSERT], 782, 0
[INSERT], 783, 0
[INSERT], 784, 0
[INSERT], 785, 0
[INSERT], 786, 1
[INSERT], 787, 0
[INSERT], 788, 0
[INSERT], 789, 0
[INSERT], 790, 0
[INSERT], 791, 1
[INSERT], 792, 1
[INSERT], 793, 0
[INSERT], 794, 0
[INSERT], 795, 1
[INSERT], 796, 0
[INSERT], 797, 0
[INSERT], 798, 0
[INSERT], 799, 0
[INSERT], 800, 0
[INSERT], 801, 0
[INSERT], 802, 0
[INSERT], 803, 0
[INSERT], 804, 0
[INSERT], 805, 0
[INSERT], 806, 0
[INSERT], 807, 0
[INSERT], 808, 1
[INSERT], 809, 0
[INSERT], 810, 1
[INSERT], 811, 0
[INSERT], 812, 0
[INSERT], 813, 0
[INSERT], 814, 1
[INSERT], 815, 0
[INSERT], 816, 0
[INSERT], 817, 0
[INSERT], 818, 0
[INSERT], 819, 0
[INSERT], 820, 0
[INSERT], 821, 0
[INSERT], 822, 0
[INSERT], 823, 0
[INSERT], 824, 2
[INSERT], 825, 0
[INSERT], 826, 0
[INSERT], 827, 0
[INSERT], 828, 0
[INSERT], 829, 0
[INSERT], 830, 0
[INSERT], 831, 0
[INSERT], 832, 0
[INSERT], 833, 1
[INSERT], 834, 0
[INSERT], 835, 1
[INSERT], 836, 0
[INSERT], 837, 0
[INSERT], 838, 1
[INSERT], 839, 0
[INSERT], 840, 0
[INSERT], 841, 0
[INSERT], 842, 1
[INSERT], 843, 0
[INSERT], 844, 2
[INSERT], 845, 0
[INSERT], 846, 1
[INSERT], 847, 1
[INSERT], 848, 1
[INSERT], 849, 2
[INSERT], 850, 1
[INSERT], 851, 2
[INSERT], 852, 0
[INSERT], 853, 1
[INSERT], 854, 1
[INSERT], 855, 0
[INSERT], 856, 1
[INSERT], 857, 0
[INSERT], 858, 0
[INSERT], 859, 2
[INSERT], 860, 0
[INSERT], 861, 0
[INSERT], 862, 0
[INSERT], 863, 0
[INSERT], 864, 0
[INSERT], 865, 1
[INSERT], 866, 0
[INSERT], 867, 0
[INSERT], 868, 0
[INSERT], 869, 1
[INSERT], 870, 0
[INSERT], 871, 0
[INSERT], 872, 0
[INSERT], 873, 1
[INSERT], 874, 0
[INSERT], 875, 0
[INSERT], 876, 0
[INSERT], 877, 0
[INSERT], 878, 1
[INSERT], 879, 0
[INSERT], 880, 0
[INSERT], 881, 1
[INSERT], 882, 0
[INSERT], 883, 1
[INSERT], 884, 0
[INSERT], 885, 0
[INSERT], 886, 0
[INSERT], 887, 1
[INSERT], 888, 1
[INSERT], 889, 0
[INSERT], 890, 1
[INSERT], 891, 0
[INSERT], 892, 0
[INSERT], 893, 1
[INSERT], 894, 1
[INSERT], 895, 0
[INSERT], 896, 0
[INSERT], 897, 1
[INSERT], 898, 1
[INSERT], 899, 0
[INSERT], 900, 0
[INSERT], 901, 1
[INSERT], 902, 0
[INSERT], 903, 0
[INSERT], 904, 0
[INSERT], 905, 0
[INSERT], 906, 0
[INSERT], 907, 0
[INSERT], 908, 0
[INSERT], 909, 1
[INSERT], 910, 0
[INSERT], 911, 0
[INSERT], 912, 1
[INSERT], 913, 1
[INSERT], 914, 0
[INSERT], 915, 0
[INSERT], 916, 0
[INSERT], 917, 0
[INSERT], 918, 0
[INSERT], 919, 1
[INSERT], 920, 1
[INSERT], 921, 1
[INSERT], 922, 0
[INSERT], 923, 0
[INSERT], 924, 0
[INSERT], 925, 1
[INSERT], 926, 1
[INSERT], 927, 0
[INSERT], 928, 0
[INSERT], 929, 0
[INSERT], 930, 0
[INSERT], 931, 0
[INSERT], 932, 0
[INSERT], 933, 1
[INSERT], 934, 0
[INSERT], 935, 0
[INSERT], 936, 0
[INSERT], 937, 1
[INSERT], 938, 1
[INSERT], 939, 0
[INSERT], 940, 0
[INSERT], 941, 1
[INSERT], 942, 0
[INSERT], 943, 1
[INSERT], 944, 0
[INSERT], 945, 0
[INSERT], 946, 0
[INSERT], 947, 1
[INSERT], 948, 0
[INSERT], 949, 0
[INSERT], 950, 1
[INSERT], 951, 0
[INSERT], 952, 1
[INSERT], 953, 2
[INSERT], 954, 0
[INSERT], 955, 0
[INSERT], 956, 0
[INSERT], 957, 0
[INSERT], 958, 0
[INSERT], 959, 0
[INSERT], 960, 0
[INSERT], 961, 0
[INSERT], 962, 1
[INSERT], 963, 0
[INSERT], 964, 1
[INSERT], 965, 0
[INSERT], 966, 0
[INSERT], 967, 0
[INSERT], 968, 0
[INSERT], 969, 0
[INSERT], 970, 0
[INSERT], 971, 0
[INSERT], 972, 0
[INSERT], 973, 0
[INSERT], 974, 0
[INSERT], 975, 0
[INSERT], 976, 0
[INSERT], 977, 0
[INSERT], 978, 0
[INSERT], 979, 0
[INSERT], 980, 0
[INSERT], 981, 0
[INSERT], 982, 0
[INSERT], 983, 0
[INSERT], 984, 0
[INSERT], 985, 0
[INSERT], 986, 0
[INSERT], 987, 0
[INSERT], 988, 0
[INSERT], 989, 0
[INSERT], 990, 0
[INSERT], 991, 0
[INSERT], 992, 0
[INSERT], 993, 0
[INSERT], 994, 0
[INSERT], 995, 0
[INSERT], 996, 0
[INSERT], 997, 0
[INSERT], 998, 0
[INSERT], 999, 0
[INSERT], >1000, 91
java -cp /home/michim/gitdev/YCSB/core/target/core-0.1.4.jar:/home/michim/gitdev/YCSB/infinispan/src/main/conf:/home/michim/gitdev/YCSB/hbase/src/main/conf:/home/michim/gitdev/YCSB/jdbc/src/main/conf:/home/michim/gitdev/YCSB/nosqldb/src/main/conf:/home/michim/gitdev/YCSB/mapkeeper/target/mapkeeper-binding-0.1.4.jar:/home/michim/gitdev/YCSB/mapkeeper/target/archive-tmp/mapkeeper-binding-0.1.4.jar:/home/michim/gitdev/YCSB/gemfire/src/main/conf:/home/michim/gitdev/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MapKeeperClient -P workloads/workloada -p mapkeeper.host=dqa-config2-006.dht.bf1.yahoo.com -p mapkeeper.port=9090 -s -threads 2000 -load